[{
    "id": "20",
    "name": "Pelle Kanin",
    "year": "2018",
    "genres": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "duration": "93M",
    "release": "2018-02-21",
    "description": "Feature adaptation of Beatrix Potter's classic tale of a rebellious rabbit trying to sneak into a farmer's vegetable garden.",
    "actors": [
        "James Corden",
        "Fayssal Bazzi",
        "Domhnall Gleeson"
    ],
    "rating": 6.1,
    "posterLink": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NzI0ODUwN15BMl5BanBnXkFtZTgwOTIxNjA0NDM@._V1_SY500_CR0,0,337,500_AL_.jpg"
},
{
    "id": "21",
    "name": "The 15:17 to Paris",
    "year": "2018",
    "genres": [
        "Drama",
        "History",
        "Thriller"
    ],
    "duration": "94M",
    "release": "2018-04-20",
    "description": "In the early evening of August 21, 2015, the world watched in stunned silence as the media reported a thwarted terrorist attack on Thalys train #9364 bound for Paris--an attempt prevented by three courageous young Americans traveling through Europe. The film follows the course of the friends' lives, from the struggles of childhood through finding their footing in life, to the series of unlikely events leading up to the attack. Throughout the harrowing ordeal, their friendship never wavers, making it their greatest weapon and allowing them to save the lives of the more than 500 passengers on board.",
    "actors": [
        "Alek Skarlatos",
        "Anthony Sadler",
        "Spencer Stone"
    ],
    "rating": 5.1,
    "posterLink": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NjUzNjYwOV5BMl5BanBnXkFtZTgwMzY1MDM0NDM@._V1_SY500_CR0,0,337,500_AL_.jpg"
},
{
    "id": "22",
    "name": "Jumanji: Welcome to the Jungle",
    "year": "2017",
    "genres": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "duration": "119M",
    "release": "2017-12-22",
    "description": "In a brand new Jumanji adventure, four high school kids discover an old video game console and are drawn into the game's jungle setting, literally becoming the adult avatars they chose. What they discover is that you don't just play Jumanji - you must survive it. To beat the game and return to the real world, they'll have to go on the most dangerous adventure of their lives, discover what Alan Parrish left 20 years ago, and change the way they think about themselves - or they'll be stuck in the game forever, to be played by others without break.                Written by\nSony Pictures",
    "actors": [
        "Dwayne Johnson",
        "Karen Gillan",
        "Kevin Hart"
    ],
    "rating": 7.2,
    "posterLink": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNDQ1MDc5OV5BMl5BanBnXkFtZTgwOTcyNzI2MzI@._V1_SY400_SX270_AL_.jpg"
},
{
    "id": "23",
    "name": "The Greatest Showman",
    "year": "2017",
    "genres": [
        "Biography",
        "Drama",
        "Musical"
    ],
    "duration": "105M",
    "release": "2017-12-25",
    "description": "Orphaned, penniless but ambitious and with a mind crammed with imagination and fresh ideas, the American Phineas Taylor Barnum will always be remembered as the man with the gift to effortlessly blur the line between reality and fiction. Thirsty for innovation and hungry for success, the son of a tailor will manage to open a wax museum but will soon shift focus to the unique and peculiar, introducing extraordinary, never-seen-before live acts on the circus stage. Some will call Barnum's wide collection of oddities, a freak show; however, when the obsessed for cheers and respectability showman gambles everything on the opera singer Jenny Lind to appeal to a high-brow audience, he will somehow lose sight of the most important aspect of his life: his family. Will Barnum risk it all to be accepted?                Written by\nNick Riganas",
    "actors": [
        "Hugh Jackman",
        "Michelle Williams",
        "Zac Efron"
    ],
    "rating": 8.0,
    "posterLink": "https://images-na.ssl-images-amazon.com/images/M/MV5BYjQ0ZWJkYjMtYjJmYS00MjJiLTg3NTYtMmIzN2E2Y2YwZmUyXkEyXkFqcGdeQXVyNjk5NDA3OTk@._V1_SY500_CR0,0,337,500_AL_.jpg"
},
{
    "id": "24",
    "name": "Maze Runner: The Death Cure",
    "year": "2018",
    "genres": [
        "Action",
        "Sci-Fi",
        "Thriller"
    ],
    "duration": "141M",
    "release": "2018-01-26",
    "description": "In the epic finale to The Maze Runner Saga, Thomas leads his group of escaped Gladers on their final and most dangerous mission yet. To save their friends, they must break into the legendary last city, a WCKD controlled labyrinth that may turn out to be the deadliest maze of all. Anyone who makes it out alive will get the answers to the questions the Gladers have been asking since they first arrived in the maze. Will Thomas and the crew make it out alive? Or will Ava Paige get her way?",
    "actors": [
        "Dylan O'Brien",
        "Ki Hong Lee",
        "Kaya Scodelario"
    ],
    "rating": 6.9,
    "posterLink": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNzk3MDc2NF5BMl5BanBnXkFtZTgwMDk3OTM1NDM@._V1_SY500_CR0,0,337,500_AL_.jpg"
},
{
    "id": "25",
    "name": "Winchester - House of Ghosts",
    "year": "2018",
    "genres": [
        "Biography",
        "Fantasy",
        "Horror"
    ],
    "duration": "99M",
    "release": "2018-02-02",
    "description": "Inspired by true events. On an isolated stretch of land 50 miles outside of San Francisco sits the most haunted house in the world. Built by Sarah Winchester, (Academy Award®-winner Helen Mirren) heiress to the Winchester fortune, it is a house that knows no end. Constructed in an incessant twenty-four hour a day, seven day a week mania for decades, it stands seven stories tall and contains hundreds of rooms. To the outsider it looks like a monstrous monument to a disturbed woman's madness. But Sarah is not building for herself, for her niece (Sarah Snook) or for the brilliant Doctor Eric Price (Jason Clarke) whom she has summoned to the house. She is building a prison, an asylum for hundreds of vengeful ghosts, and the most terrifying among them have a score to settle with the Winchesters.",
    "actors": [
        "Helen Mirren",
        "Sarah Snook",
        "Finn Scicluna-O'Prey"
    ],
    "rating": 5.3,
    "posterLink": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2OWE5OGItMTE4Yi00ZmIzLThjZDctNTU1OTMxMTc3Yjg4XkEyXkFqcGdeQXVyMjM4NTM5NDY@._V1_SY500_CR0,0,315,500_AL_.jpg"
},
{
    "id": "26",
    "name": "The Post",
    "year": "2017",
    "genres": [
        "Biography",
        "Drama",
        "History"
    ],
    "duration": "116M",
    "release": "2018-01-26",
    "description": "When American military analyst, Daniel Ellsberg, realizes to his disgust the depths of the US government's deceptions about the futility of the Vietnam War, he takes action by copying top-secret documents that would become the Pentagon Papers. Later, Washington Post owner, Kay Graham, is still adjusting to taking over her late husband's business when editor Ben Bradlee discovers the New York Times has scooped them with an explosive expose on those papers. Determined to compete, Post reporters find Ellsberg himself and a complete copy of those papers. However, the Post's plans to publish their findings are put in jeopardy with a Federal restraining order that could get them all indicted for Contempt. Now, Kay Graham must decide whether to back down for the safety of her paper or publish and fight for the Freedom of the Press. In doing so, Graham and her staff join a fight that would have America's democratic ideals in the balance.                Written by\nKenneth Chisholm (kchishol@rogers.com)",
    "actors": [
        "Meryl Streep",
        "Tom Hanks",
        "Sarah Paulson"
    ],
    "rating": 7.4,
    "posterLink": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyMjEwOTIwNV5BMl5BanBnXkFtZTgwOTkzNTMxNDM@._V1_SY500_CR0,0,337,500_AL_.jpg"
},
{
    "id": "27",
    "name": "Hostiles",
    "year": "2017",
    "genres": [
        "Adventure",
        "Drama",
        "Western"
    ],
    "duration": "134M",
    "release": "2018-04-06",
    "description": "In 1892, a legendary Army captain reluctantly agrees to escort a Cheyenne chief and his family through dangerous territory.",
    "actors": [
        "Scott Shepherd",
        "Rosamund Pike",
        "Ava Cooper"
    ],
    "rating": 7.3,
    "posterLink": "https://images-na.ssl-images-amazon.com/images/M/MV5BNjFhZjM4ZDYtMGRjYi00Yzc2LWExYmEtMDQ3NzA4ODU4YTljXkEyXkFqcGdeQXVyNjkwMzU3NDI@._V1_SY500_CR0,0,337,500_AL_.jpg"
},
{
    "id": "28",
    "name": "The Shape of Water",
    "year": "2017",
    "genres": [
        "Adventure",
        "Drama",
        "Fantasy"
    ],
    "duration": "123M",
    "release": "2018-02-14",
    "description": "From master storyteller Guillermo del Toro comes THE SHAPE OF WATER, an otherworldly fable set against the backdrop of Cold War era America circa 1962. In the hidden high-security government laboratory where she works, lonely Elisa (Sally Hawkins) is trapped in a life of isolation. Elisa's life is changed forever when she and co-worker Zelda (Octavia Spencer) discover a secret classified experiment. Rounding out the cast are Michael Shannon, Richard Jenkins, Michael Stuhlbarg, and Doug Jones.                Written by\nFox Searchlight Pictures",
    "actors": [
        "Sally Hawkins",
        "Octavia Spencer",
        "Michael Shannon"
    ],
    "rating": 7.8,
    "posterLink": "https://images-na.ssl-images-amazon.com/images/M/MV5BNGNiNWQ5M2MtNGI0OC00MDA2LWI5NzEtMmZiYjVjMDEyOWYzXkEyXkFqcGdeQXVyMjM4NTM5NDY@._V1_SY500_CR0,0,337,500_AL_.jpg"
}
]